<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SubjectsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $subject = [
            'ភាសាអង់គ្លេសសម្រាប់ទំនាក់ទំនង',
            'អប់រំភាសាអង់គ្លេស',
            'ហិរញ្ញវត្ថុនិងធនាគារ',
            'សេដ្ឋកិច្ចអភិវឌ្ឍន៍',
            'វិនិយោគនិងផ្សារភាគហ៊ុន',
            'ប្រវត្តិវិទ្យា',
            'ទស្សនវិជ្ជា',
            'អក្សរសាស្ត្រខ្មែរ',
            'គណិតវិទ្យា',
            'គីមីវិទ្យា',
            'រូបវិទ្យា',
            'ជីវវិជ្ជា',
            'រៀបចំបណ្ដាញកុំព្យូទ័រ',
            'សរសេរកម្មវិធីគ្រប់គ្រងកុំព្យូទ័រ',
            'ទីផ្សារនិងទំនាក់ទំនង',
            'គ្រប់គ្រងនិងភាពជាអ្នកដឹកនាំ',
            'ច្បាប់',
            'រដ្ឋបាលសាធារណៈ',
            'ទំនាក់ទំនងអន្តរជាតិ',
            'គ្រប់គ្រងបដិសណ្ឋារកិច្ចនិងទេសចរណ៍',
            'គ្រប់គ្រងបដិសណ្ឋាគតកិច្ចអន្តរជាតិនិងព្រឹត្តិការណ៍ផ្សេងៗ',
            'គ្រប់គ្រងឧទ្យានការកំសាន្តនិងទេសចរណ៍',
            'គ្រប់គ្រងពាណិជ្ជកម្ម',
            'អក្សរសាស្ត្រអង់គ្លេស',
            'គ្រប់គ្រងហិរញ្ញវត្ថុនិងធនាគារ',
            'វិទ្យាសាស្ត្រកុំព្យូទ័រនិងព័ត៌មានវិទ្យា',
            'គ្រប់គ្រងទេសចរណ៍និងបដិសណ្ឋារកិច្ច'
        ];

        foreach ($subject as $sub) {
            DB::table('subjects')->insert([
                'subject_name' => $sub
            ]);
        }
    }
}
